SkyRocketToys/STM8TX/lib/beken.c
// -----------------------------------------------------------------------------
/** Write a single byte command to the SPI bus (e.g. Flush) */
void SPI_Write_Cmd(
	uint8_t reg) ///< The simple command to write #BK_SPI_CMD_e
{
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_write(1, &reg);
	spi_force_chip_select(false); // CSN high again
}

// ----------------------------------------------------------------------------
/** Writes value 'value' to register 'reg' */
void SPI_Write_Reg(
	uint8_t reg,  ///< The command to write #BK_SPI_CMD_e
	uint8_t value) ///< The data value to write
{
	uint8_t tx[2];
	tx[0] = reg; // For actual registers, the caller must add BK_WRITE_REG flag to reg.
	tx[1] = value;
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_write(2, &tx[0]);
	spi_force_chip_select(false); // CSN high again
}

// ----------------------------------------------------------------------------
/** Read the status from the BK2425 */
uint8_t SPI_Read_Status(void)
{
	uint8_t tx = BK_NOP;
	uint8_t rx = 0;
	spi_force_chip_select(true); // CSN low, init SPI transaction
    spi_transfer(1, &tx, &rx);
	spi_force_chip_select(false); // CSN high again
	return rx; // return register value
}

// ----------------------------------------------------------------------------
/** Read one uint8_t from BK2425 register 'reg' via SPI
\return The register value */
uint8_t SPI_Read_Reg(
	uint8_t reg)  ///< The command to write #BK_SPI_CMD_e
{
	uint8_t tx[2];
	uint8_t rx[2];
	tx[0] = reg;
	tx[1] = 0;
	spi_force_chip_select(true); // CSN low, init SPI transaction
	spi_transfer(2, &tx[0], &rx[0]); // Select register to read from..
	spi_force_chip_select(false); // CSN high again
	return rx[1]; // return register value
}

// ----------------------------------------------------------------------------
/** Writes contents of a buffer to BK2425 via SPI */
void SPI_Write_Buf(
	uint8_t reg,   ///< The command to write #BK_SPI_CMD_e
	const uint8_t *pBuf,  ///< The data to write
	uint8_t length) ///< The length in bytes of the data to write
{
	spi_force_chip_select(true);
	spi_write(1, &reg);
	spi_write(length, pBuf);
	spi_force_chip_select(false);
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Rx mode */
void SwitchToRxMode(void)
{
	uint8_t value;

	SPI_Write_Cmd(BK_FLUSH_RX); // flush Rx
 	value = SPI_Read_Status(); // read register STATUS's value
	SPI_Write_Reg(BK_WRITE_REG|BK_STATUS, value); // clear RX_DR or TX_DS or MAX_RT interrupt flag

	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG);	// read register CONFIG's value
	value |= BK_CONFIG_PRIM_RX; // set bit 0
	SPI_Write_Reg(BK_WRITE_REG | BK_CONFIG, value); // Set PWR_UP bit, enable CRC(2 length) & Prim:RX. RX_DR enabled..

	BEKEN_CE_HIGH();
	BEKEN_PA_LOW();
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Tx mode */
void SwitchToTxMode(void)
{
	uint8_t value;
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx

	BEKEN_PA_HIGH();
	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG); // read register CONFIG's value
	value &= ~BK_CONFIG_PRIM_RX; // Clear bit 0 (PTX)
	SPI_Write_Reg(BK_WRITE_REG | BK_CONFIG, value); // Set PWR_UP bit, enable CRC(2 length) & Prim:RX. RX_DR enabled.
	BEKEN_CE_HIGH();
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Idle mode */
void SwitchToIdleMode(void)
{
	uint8_t value;
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx

	BEKEN_PA_LOW();
	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
}

// ----------------------------------------------------------------------------
/** Switch the Beken radio to Sleep mode */
void SwitchToSleepMode(void)
{
	uint8_t value;

	SPI_Write_Cmd(BK_FLUSH_RX); // flush Rx
 	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx
 	value = SPI_Read_Status(); // read register STATUS's value
	SPI_Write_Reg(BK_WRITE_REG|BK_STATUS, value); // clear RX_DR or TX_DS or MAX_RT interrupt flag

	BEKEN_PA_LOW();
	BEKEN_CE_LOW();
	for (value = 0; value < 40; ++value)
		nop();
	value = SPI_Read_Reg(BK_CONFIG);	// read register CONFIG's value
	value |= BK_CONFIG_PRIM_RX; // Receive mode
	value &= ~BK_CONFIG_PWR_UP; // Power down
	SPI_Write_Reg(BK_WRITE_REG | BK_CONFIG, value); // Clear PWR_UP bit, enable CRC(2 length) & Prim:RX. RX_DR enabled..
	// Stay low
	BEKEN_CE_LOW();
}

// ----------------------------------------------------------------------------
/** Set which register bank we are accessing on the Beken spi chip */
void SetRBank(
	char _cfg) ///< 1=Bank1 0=Bank0
{
#if RADIO_BEKEN
	uint8_t bank = SPI_Read_Status() & BK_STATUS_RBANK;
	if (!bank != !_cfg)
	{
		SPI_Write_Reg(BK_ACTIVATE_CMD, 0x53);
	}
#endif
}

#if (TX_SPEED==250)
ITX_SPEED gTxSpeed = ITX_250;
#elif (TX_SPEED==100)
ITX_SPEED gTxSpeed = ITX_1000;
#elif (TX_SPEED==2000)
ITX_SPEED gTxSpeed = ITX_2000;
#endif

// ----------------------------------------------------------------------------
/** Return the current speed in kbps */
int BK2425_GetSpeed(void)
{
	switch (gTxSpeed) {
	case ITX_250: return 250;
	case ITX_1000: return 1000;
	case ITX_2000: return 2000;
	default: return 0;
	};
}

// ----------------------------------------------------------------------------
/** BK2425 initialization of radio registers */
void BK2425_Initialize(
	ITX_SPEED spd) ///< The baudrate to modulate the transmission and reception at.
{
	int8_t i;
	bkReady = 0;
	gTxSpeed = spd;
	delay_ms(100);//delay more than 50ms.
	SetRBank(0);

	//********************Write Bank0 register******************
	for (i=20; i >= 0; i--) // From BK_FIFO_STATUS back to beginning of table
	{
		uint8_t idx = Bank0_Reg[i][0];
		uint8_t value = Bank0_Reg[i][1];
		if (idx == BK_RF_SETUP) // Adjust for speed
			value = Bank0_Reg6[spd][1];
		SPI_Write_Reg((BK_WRITE_REG|idx), value);
	}

	// Set the various 5 byte addresses
	SPI_Write_Buf((BK_WRITE_REG|BK_RX_ADDR_P0),RX0_Address,5); // reg 10 - Rx0 addr
	SPI_Write_Buf((BK_WRITE_REG|BK_RX_ADDR_P1),RX1_Address,5); // REG 11 - Rx1 addr
	SPI_Write_Buf((BK_WRITE_REG|BK_TX_ADDR),TX1_Address,5); // REG 16 - TX addr

#if RADIO_BEKEN
	i = SPI_Read_Reg(BK_FEATURE);
	if (i == 0) // i!=0 showed that chip has been actived.so do not active again.
		SPI_Write_Reg(BK_ACTIVATE_CMD,0x73);// Active
#endif
	for (i = 22; i >= 21; i--)
		SPI_Write_Reg((BK_WRITE_REG|Bank0_Reg[i][0]),Bank0_Reg[i][1]);

#if RADIO_BEKEN
	//********************Write Bank1 register******************
	SetRBank(1);
	for (i = IREG1_4; i <= IREG1_13; i++)
	{
		const uint8_t* p = &Bank1_RegTable[spd][i][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}
	SPI_Write_Buf((BK_WRITE_REG|BK2425_R1_14),&(Bank1_Reg14[0]),11);

//toggle REG4<25,26>
	{
		const uint8_t* p = &Bank1_RegTable[spd][IREG1_4A][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}
	{
		const uint8_t* p = &Bank1_RegTable[spd][IREG1_4][0];
		uint8_t idx = *p++;
		SPI_Write_Buf((BK_WRITE_REG|idx), p, 4);
	}

