SkyRocketToys/STM8TX/lib/beken.c
	delay_ms(100);//delay more than 50ms.

	/********************switch back to Bank0 register access******************/
	SetRBank(0);
#else
	delay_ms(100);
#endif
	SwitchToRxMode(); // switch to RX mode
	bkReady = 1;
}

// ----------------------------------------------------------------------------
bool bRadioFast = false;
/** Change between 250kbps and 2000kbps on the fly */
void BK2425_SetSpeed(
	bool bFast) ///< false=slow speed, true=fast speed
{
	ITX_SPEED spd = ITX_250;
	if (bFast == bRadioFast)
		return;
	if (bFast)
		spd = ITX_2000;
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP);
	SwitchToSleepMode();
	BK2425_Initialize(spd);
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP_IRQ);
	bRadioFast = bFast;
}

#if RADIO_BEKEN
// ----------------------------------------------------------------------------
/** Write a 32-bit Bank1 register */
void SPI_Bank1_Write_Reg(
	uint8_t reg, ///< A spi register in bank1 to write to #BK_SPI_CMD_e
	const uint8_t *pBuf) ///< A pointer to a 32-bit buffer to be written
{
	SetRBank(1);
	SPI_Write_Buf(reg, pBuf, 4);
	SetRBank(0);
}

// ----------------------------------------------------------------------------
/** Read a 32-bit Bank1 register */
void SPI_Bank1_Read_Reg(
	uint8_t reg, ///< A spi register in bank1 to write to #BK_SPI_CMD_e
	uint8_t *pBuf) ///< A pointer to a 32-bit buffer to be read into
{
	SetRBank(1);
	spi_read_registers(reg, pBuf, 4);
	SetRBank(0);
}
#endif

// ----------------------------------------------------------------------------
/** Change the radio channel */
void ChangeChannel(
	uint8_t channelNumber) ///< A physical radio channel. See #CHANNEL_MHZ_e
{
	if (channelNumber > CHANNEL_MAX_PHYSICAL)
		return;
	SPI_Write_Reg((BK_WRITE_REG|BK_RF_CH), channelNumber);
}

// ----------------------------------------------------------------------------
/* Clear the radio acknowledge overflow status of the Beken chip.
	\return true if BK_STATUS_MAX_RT was found in the set state, false otherwise */
bool ClearAckOverflow(void)
{
	uint8_t status = SPI_Read_Status();
	if ((BK_STATUS_MAX_RT & status) == 0)
	{
    	return false;
	}
	else
	{
		SPI_Write_Reg((BK_WRITE_REG|BK_STATUS), BK_STATUS_MAX_RT);
    	return true;
	}
}

// ----------------------------------------------------------------------------
// Set up the addresses
void beken_set_address(void)
{
	const uint8_t* uuid = (const uint8_t*) U_ID00;
	uint32_t address = crc_crc32(uuid, 12); // Unique chip ID (x:16, y:16, wafer:8, lot:56)

	TX0_Address[0] = 0x32;
	TX0_Address[1] = 0x99;
	TX0_Address[2] = 0x59;
	TX0_Address[3] = 0xC6;
	TX0_Address[4] = 0x2D;

	TX1_Address[0] = 0x31;
	TX1_Address[1] = (address >> 16) & 0xff;
	TX1_Address[2] = 0x59;
	TX1_Address[3] = (address >> 8) & 0xff;
	TX1_Address[4] = (address) & 0xff;

	RX1_Address[0] = RX0_Address[0] = 0x33;
	RX1_Address[1] = RX0_Address[1] = (address >> 16) & 0xff;
	RX1_Address[2] = RX0_Address[2] = 0x59;
	RX1_Address[3] = RX0_Address[3] = (address >> 8) & 0xff;
	RX1_Address[4] = RX0_Address[4] = (address) & 0xff;
}

// ----------------------------------------------------------------------------
/** Initialise the Beken chip ready to be talked to */
void initBeken(void)
{
	beken_set_address();

	/* Set ChipSelect pin in Output push-pull high level in spi_init() */
    gpio_config(RADIO_TXEN, GPIO_OUTPUT_PUSHPULL);
    gpio_config(RADIO_CE, GPIO_OUTPUT_PUSHPULL);

	BEKEN_DESELECT();
	BEKEN_CE_LOW();
}

// ----------------------------------------------------------------------------
/** DeInitialise the Beken chip after talking */
void deinitBeken(void)
{
}

// ----------------------------------------------------------------------------
/** Describe our transmission parameters to the serial port for verification by the tester */
void describeBeken(void)
{
#if SUPPORT_UART
	uint8_t i;
	printf("# TxSpeed %dkbps\r\n", (int) BK2425_GetSpeed() );
	printf("# Channels[%d]=", (int) CHANNEL_COUNT_LOGICAL );
	for (i = 0; i < CHANNEL_COUNT_LOGICAL; ++i)
	{
		printf("%d ", (int) LookupChannel(i));
	}
	printf("\r\n##########\r\n");
#endif
}

// ----------------------------------------------------------------------------
/** Change address */
void ChangeAddressTx(
	uint8_t txch) ///< 0 for data, 1 for binding
{
	if (txch)
	{
		SPI_Write_Buf((BK_WRITE_REG|BK_TX_ADDR), TX1_Address, 5); // REG 16 - TX addr
	}
	else
	{
		SPI_Write_Buf((BK_WRITE_REG|BK_TX_ADDR), TX0_Address, 5); // REG 16 - TX addr
	}
}

// ----------------------------------------------------------------------------
/** Change the radio output power of the Beken radio chip */
void ChangeOutputPower(
	uint8_t power) ///< power value
{
	uint8_t setup;
	if (power > 3)
		return;
	setup = SPI_Read_Reg(BK_RF_SETUP);
	setup &= ~(3 << 1);
	setup |= (power << 1);
	SPI_Write_Reg((BK_WRITE_REG|BK_RF_SETUP), setup);
}

// ----------------------------------------------------------------------------
/** Kick the independant windowed watchdog so that it does not reset the CPU by timing out */
void IWDG_Kick(void)
{
#if SUPPORT_WATCHDOG
	IWDG->KR = IWDG_KEY_REFRESH; // Kick the watchdog so we don't reset
#endif
}

// ----------------------------------------------------------------------------
/** Fill the Bekens tx FIFO to send a packet
	\return True if ack overflow was set when send was requested. */
bool Send_Packet(
	uint8_t type, ///< WR_TX_PLOAD or W_TX_PAYLOAD_NOACK_CMD
	const uint8_t* pbuf, ///< a buffer pointer
	uint8_t len) ///< packet length in bytes
{
	// read register FIFO_STATUS's value
	uint8_t fifo_sta = SPI_Read_Reg(BK_FIFO_STATUS);	// read register FIFO_STATUS's value
	bool returnValue = ClearAckOverflow();

	if (!(fifo_sta & BK_FIFO_STATUS_TX_FULL)) // if not full, send data
	{
		gTxPackets++;
		SPI_Write_Buf(type, pbuf, len); // Writes data to buffer A0,B0,A8
	}

	return returnValue;
}

// ----------------------------------------------------------------------------
/** Read FIFO to read a packet
	\returns 0 if no packet, 1 if packet read */
uint8_t Receive_Packet(
	uint8_t rx_buf[]) ///< The buffer to fill
{
	uint8_t len, sta, fifo_sta, returnVal;
	returnVal = 0;
	sta = SPI_Read_Reg(BK_STATUS); // read register STATUS's value
	if (sta & BK_STATUS_RX_DR) // if receive data ready (RX_DR) interrupt
	{
		do
		{
			gRxPackets++;
			len = SPI_Read_Reg(BK_R_RX_PL_WID_CMD);	// read received packet length in bytes
			gLastRxLen = len;

			if (len <= PACKET_LENGTH_RX_MAX)
			{
				// This includes short packets (e.g. where no telemetry was sent)
				spi_read_registers(BK_RD_RX_PLOAD, rx_buf, len); // read receive payload from RX_FIFO buffer
				returnVal = 1;
			}
			else // Packet was too long
			{
				SPI_Write_Reg(BK_FLUSH_RX, 0); // flush Rx
			}
			fifo_sta = SPI_Read_Reg(BK_FIFO_STATUS);	// read register FIFO_STATUS's value
		} while (!(fifo_sta & BK_FIFO_STATUS_RX_EMPTY)); // while not empty
	}
	SPI_Write_Reg(BK_WRITE_REG | BK_STATUS,
		(BK_STATUS_RX_DR | BK_STATUS_TX_DS | BK_STATUS_MAX_RT)); // clear RX_DR or TX_DS or MAX_RT interrupt flag
	return returnVal;
}

// ----------------------------------------------------------------------------
/** Flush the Beken radio TX buffer */
void FlushTx(void)
{
	SPI_Write_Cmd(BK_FLUSH_TX); // flush Tx
}

// ----------------------------------------------------------------------------
/** Get the Beken radio chip ID
	\return BK_CHIP_ID_BK2425 */
uint8_t Get_Chip_ID(void)
{
#if RADIO_BEKEN
	uint8_t ReadArr[4];
	SPI_Bank1_Read_Reg(BK2425_R1_WHOAMI, ReadArr);
	return ReadArr[0];
#else
	return 99; // Correct value
#endif
}

// ----------------------------------------------------------------------------
/** Ensure that the chip id is good */
void VerifyBekenChipID(void)
{
	uint8_t id = Get_Chip_ID();
#if SUPPORT_UART
	printf("\r\n# Chip ID: %u\r\n", id);
#endif
	while (id != BK_CHIP_ID_BK2425)
	{
#if SUPPORT_UART
		printf("Chip ID Failed: %u\r\n", id);
#endif
		IWDG_Kick();
		initBeken();
		delay_ms(200);
		id = Get_Chip_ID();
	}
}

// ----------------------------------------------------------------------------
// Frequency hopping
// ----------------------------------------------------------------------------

uint8_t gChannelIdxMin = 0;
uint8_t gChannelIdxMax = CHANNEL_COUNT_LOGICAL * CHANNEL_DWELL_PACKETS;

const uint8_t channelTable[CHANNEL_COUNT_LOGICAL] = {
#if (CHANNEL_COUNT_LOGICAL==60) // Use 15 channels 4 times
#if 1
//	54,54,54,54,54,54,54,54,54,54,54,54,54,54,54,
//	54,54,54,54,54,54,54,54,54,54,54,54,54,54,54,
//	54,54,54,54,54,54,54,54,54,54,54,54,54,54,54,
//	54,54,54,54,54,54,54,54,54,54,54,54,54,54,54,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
	23,23,23,23,23,23,23,23,23,23,23,23,23,23,23,
#else
	46,41,31,52,36,13,72,69,21,56,16,26,61,66,10,
	46,41,31,52,36,13,72,69,21,56,16,26,61,66,10,
	46,41,31,52,36,13,72,69,21,56,16,26,61,66,10,
	46,41,31,52,36,13,72,69,21,56,16,26,61,66,10,
#endif
#endif
};

// ----------------------------------------------------------------------------
/** Set the range of the channel indexes we are using
\return true if we changed something */
bool SetChannelRange(
	uint8_t min, ///< The minimum logical channel range
	uint8_t max) ///< The maximum logical channel range
{
	min *= CHANNEL_DWELL_PACKETS;
	max *= CHANNEL_DWELL_PACKETS;
	if ((gChannelIdxMin != min) || (gChannelIdxMax != max))
	{
		gChannelIdxMin = min;
		gChannelIdxMax = max;
		return true;
	}
	return false;
}

// ----------------------------------------------------------------------------
/** Convert a logical channel index into a physical channel
\return The physical channel, in MHz above 2400Mhz. */
uint8_t LookupChannel(
	uint8_t idx) ///< The logical channel, as an index into a frequency hopping table.
{
	return channelTable[idx / CHANNEL_DWELL_PACKETS];
}

// ----------------------------------------------------------------------------
/** Channel hopping algorithm implementation.
	Calculate the next channel to use for transmission and change to it
	\return The next value of the logical channel index. */
uint8_t NextChannelIndex(
	uint8_t seq) ///< The current value of the logical channel index
{
	{
		++seq;
		if (seq >= gChannelIdxMax)
			seq = gChannelIdxMin;
		else if (seq < gChannelIdxMin)
			seq = gChannelIdxMin;
	}
	return seq;
}


// ----------------------------------------------------------------------------
// Interface expected by main program
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
/** Initialise the Beken radio chip */
void beken_init(void)
{
	// Initialise the firmware data
	uint32_t crc = crc_crc32((const uint8_t *)0x8700, (0xc000-0x8700));
	gFwInfo[INFO_FW_CRC_LO] = crc & 0xffff;
	gFwInfo[INFO_FW_CRC_HI] = (crc >> 16) & 0xffff;
	gFwInfo[INFO_FW_VER] = 0;
	gFwInfo[INFO_DFU_RX] = 0;
	gFwInfo[INFO_FW_YM] = 0;
	gFwInfo[INFO_FW_DAY] = 0;
	gFwInfo[INFO_MODEL] = 1;
	gFwInfo[INFO_RSSI] = 0; // ... needs to be updated over time
	gFwInfo[INFO_BATTERY] = 0; // ... needs to be updated over time

	// Setup the Beken chip. Assumes that SPI is initialised by now
	delay_ms(10);
	initBeken();
	IWDG_Kick();
	delay_ms(200);

	VerifyBekenChipID();
	IWDG_Kick();
	switch (BK2425_GetSpeed()) { // Use the default speed
	case 250: BK2425_Initialize(ITX_250); break;
	case 1000: BK2425_Initialize(ITX_1000); break;
	case 2000: BK2425_Initialize(ITX_2000); break;
	}
	// Should now be in Rx mode
	// Configure radio interrupt
	gpio_config(RADIO_INT, GPIO_INPUT_PULLUP_IRQ);
	SwitchToRxMode();
}

// ----------------------------------------------------------------------------
void ProcessPacket(packetFormatRx* rx, uint8_t rxstd)
{
	if (rx->packetType == BK_PKT_TYPE_TELEMETRY)
	{
		lastTelemetryPktTime = timer_get_ms();
	}
	else if (rx->packetType == BK_PKT_TYPE_DFU)
	{
		//...
	}
}

// ----------------------------------------------------------------------------
/** The IRQ routine that needs to be called on radio interrupts for the Beken chip */
void beken_irq(void)
{
	// Determine which state fired the interrupt
	uint8_t bk_sta = SPI_Read_Reg(BK_STATUS);
	if (bk_sta & BK_STATUS_TX_DS)
	{
		// Packet was sent successfully (not yet acknowledged)
		sentPacketCount++;
		SwitchToRxMode(); // Prepare to receive reply
	}
	if (bk_sta & BK_STATUS_MAX_RT)
	{
		// We have had a "max retries" error
	}
	if (bk_sta & BK_STATUS_RX_DR)
	{
		// We have received a packet
		uint8_t rxstd = 0;
		// Which pipe (address) have we received this packet on?
		if ((bk_sta & BK_STATUS_RX_MASK) == BK_STATUS_RX_P_0)
		{
			rxstd = 0;
		}
		else
		{
			badRxAddress++;
		}
		ackPacketCount++;
		bFreshData = 1;
		Receive_Packet((uint8_t *)&pktDataRecv);
		memcpy(&pktDataRx, &pktDataRecv, sizeof(pktDataRx));
		ProcessPacket(&pktDataRx, rxstd);
	}

