SkyRocketToys/STM8TX/lib/beken.c
	// Clear the bits
	SPI_Write_Reg((BK_WRITE_REG|BK_STATUS), (BK_STATUS_MAX_RT | BK_STATUS_TX_DS | BK_STATUS_RX_DR));
}

// ----------------------------------------------------------------------------
static bool isDisconnected(void)
{
	return (lastTelemetryPktTime == 0) || (timer_get_ms() > lastTelemetryPktTime + 1000);
}

// ----------------------------------------------------------------------------
// Update a radio control packet
// Called from IRQ context
void UpdateTxData(void)
{
	static uint8_t txInfo = 0;
	uint16_t val;

	// Base values for this packet type
	pktDataTx.packetType = isDisconnected() ? BK_PKT_TYPE_CTRL_LOST : BK_PKT_TYPE_CTRL_FOUND; ///< The packet type
//	pktDataTx.channel;
	pktDataTx.u.ctrl.lsb = 0;
	pktDataTx.u.ctrl.buttons_held = get_buttons_held();
	pktDataTx.u.ctrl.buttons_toggled = get_buttons_toggled();
	pktDataTx.u.ctrl.data_type = 0;
	pktDataTx.u.ctrl.data_value_lo = 0;
	pktDataTx.u.ctrl.data_value_hi = 0;

	// Put in the stick values
	val = channel_value(0);
	pktDataTx.u.ctrl.throttle = val >> 2;
	pktDataTx.u.ctrl.lsb |= (val & 3) << 0;
	val = channel_value(1);
	pktDataTx.u.ctrl.roll = val >> 2;
	pktDataTx.u.ctrl.lsb |= (val & 3) << 2;
	val = channel_value(2);
	pktDataTx.u.ctrl.pitch = val >> 2;
	pktDataTx.u.ctrl.lsb |= (val & 3) << 4;
	val = channel_value(3);
	pktDataTx.u.ctrl.yaw = val >> 2;
	pktDataTx.u.ctrl.lsb |= (val & 3) << 6;

	// Put in the extra data fields
	if (++txInfo >= INFO_MAX)
		txInfo = 1;
	val = gFwInfo[txInfo];
	pktDataTx.u.ctrl.data_type = txInfo;
	pktDataTx.u.ctrl.data_value_lo = val & 0xff;
	pktDataTx.u.ctrl.data_value_hi = (val >> 8) & 0xff;
}

// ----------------------------------------------------------------------------
void UpdateTxBindData(void)
{
	pktDataTx.packetType = BK_PKT_TYPE_BIND;
//	pktDataTx.channel;
	pktDataTx.u.bind.bind_address[0] = RX0_Address[0];
	pktDataTx.u.bind.bind_address[1] = RX0_Address[1];
	pktDataTx.u.bind.bind_address[2] = RX0_Address[2];
	pktDataTx.u.bind.bind_address[3] = RX0_Address[3];
	pktDataTx.u.bind.bind_address[4] = RX0_Address[4];
	pktDataTx.u.bind.hopping = 0;
}

// ----------------------------------------------------------------------------
/** The IRQ routine that needs to be called on timer interrupts for the Beken chip */
void beken_timer_irq(void)
{
	static uint8_t txChannel = 0;
	static uint8_t bindTimer = 0;
	// No need for this as caller takes care of it:
	// TIM4->SR1 = (uint8_t)(~TIM4_IT_UPDATE);
	if (!bkReady) // We are reinitialising the chip in the main thread
		return;

	// Change to the next (non-ignored) channel
	txChannel = NextChannelIndex(txChannel);
	ChangeChannel(LookupChannel(txChannel));
	FlushTx(); // Discard any buffered tx bytes
	ClearAckOverflow();

	// Support sending binding packets
	if (isDisconnected())
	{
		if (++bindTimer >= 7)
		{
			bindTimer = 0;
			SwitchToIdleMode();
			ChangeAddressTx(1); // Binding address
			SwitchToTxMode();
			UpdateTxBindData();
			pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
			lastTxChannel = txChannel;
			Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&pktDataTx, PACKET_LENGTH_TX_BIND);
			return;
		}
		else if (bindTimer == 0)
		{
			SwitchToIdleMode();
			ChangeAddressTx(0); // Unique address for this controls
		}
	}
	else if (bindTimer != 99)
	{
		bindTimer = 99;
		SwitchToIdleMode();
		ChangeAddressTx(0); // Unique address for this controls
	}
	SwitchToTxMode();
	UpdateTxData();
	pktDataTx.channel = txChannel; // Tell the receiver where in the sequence this was broadcast from.
	lastTxChannel = txChannel;
	lastTxPacketCount++;
	Send_Packet(BK_WR_TX_PLOAD, (uint8_t *)&pktDataTx, PACKET_LENGTH_TX_CTRL);
}

// ----------------------------------------------------------------------------
/** Start sending a binding packet */
void beken_start_bind_send(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending a control data packet */
void beken_start_send(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending an FCC test packet */
void beken_start_FCC_test(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Start sending an factory test packet */
void beken_start_factory_test(
	uint8_t test_mode) ///< The type of test to send.
{
	//...
}

// ----------------------------------------------------------------------------
/** Set the next FCC power */
void beken_next_FCC_power(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Go into continuous carrier wave send mode or normal mode */
void beken_set_CW_mode(
	bool cw) ///< false=normal, true=carrier wave
{
	//...
}

// ----------------------------------------------------------------------------
/** Change the FCC channel */
void beken_change_FCC_channel(
	int8_t change) ///< ?
{
	//...
}

// ----------------------------------------------------------------------------
/** Toggle the FCC scan */
void beken_FCC_toggle_scan(void)
{
	//...
}

// ----------------------------------------------------------------------------
/** Get the current tx power */
uint8_t get_tx_power(void)
{
	//...
	return 0;
}

// ----------------------------------------------------------------------------
/** Get the current FCC channel */
int8_t get_FCC_chan(void)
{
	//...
	return -1; // We are not in fcc mode
}

// ----------------------------------------------------------------------------
/** Get the current FCC power */
uint8_t get_FCC_power(void)
{
	//...
	return 0;
}

#if 0
uint8_t get_telem_pps(void)
{
    return 0;
}

void radio_set_pps_rssi(void)
{
}

#endif

/** @}*/

#endif
